Revit 2026 API

# ExternalDefinitionCreationOptions Methods

---

The ExternalDefinitionCreationOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetDataType | Gets the identifier describing the parameter's data type. The identifier may belong to either a spec or a category. If it is a category, the parameter is a Family Type parameter of that category. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetDataType | Sets the parameter's data type. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

ExternalDefinitionCreationOptions Class

Autodesk.Revit.DB Namespace